import pandas as pd
# data = {
#     'набор А' : [85, 98, 95, 100, 105],
#     'набор Б' : [70, 88, 105, 120, 130]
#
# }
#
# df = pd.DataFrame(data)
#
# stdA = df['набор А'].std()
# stdB = df['набор Б'].std()
#
# print(f'стандартное отклонение набор 1{stdA}')
# print(stdB)

data = {
    'возраст' : [23, 25, 26, 28, 21, 28, 29, 30, 35, 41],
    'зарплата' : [54000, 55000, 52000, 55000, 50000, 57000, 54000, 49000, 51000, 200000]

}

df = pd.DataFrame(data)

print(f'cредний возраст - {df['возраст'].mean()}')
print(f'медианный возраст - {df['возраст'].median()}')
print(f'стандартное отклонение возраста - {df['возраст'].std()}')
print(f'cредняя зарплата - {df['зарплата'].mean()}')
print(f'медианная зарплата - {df['зарплата'].median()}')
print(f'cтандартное отклонение зп - {df['зарплата'].std()}')



# print(df.describe())